<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>char_id.json</key>
		<data>
		8Vc4ZzqBo4NZrWXXeiWrQ/4aEYI=
		</data>
		<key>model.espresso.net</key>
		<data>
		nl4IOEePrYsFZ1Wr+4QoWw7W5h4=
		</data>
		<key>model.espresso.shape</key>
		<data>
		lF2wSOkd21UBmKvG+sdjcnC1Hlo=
		</data>
		<key>model.espresso.weights</key>
		<data>
		tC8y0Ttrg/sgAB4Pw02eO9QTUhM=
		</data>
		<key>sentiment.nlmodel</key>
		<data>
		HB70/+zMkU4gLReiP6GI7q7MjJo=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>char_id.json</key>
		<dict>
			<key>hash</key>
			<data>
			8Vc4ZzqBo4NZrWXXeiWrQ/4aEYI=
			</data>
			<key>hash2</key>
			<data>
			JWoRy+gA3CqItSLF9TFMGdSdeXXXy7RDtHXQHW/mUNw=
			</data>
		</dict>
		<key>model.espresso.net</key>
		<dict>
			<key>hash</key>
			<data>
			nl4IOEePrYsFZ1Wr+4QoWw7W5h4=
			</data>
			<key>hash2</key>
			<data>
			R/4FXRhzhdKGSmMO0cxFekM5+a/CMs0M+gbrGFGcxBo=
			</data>
		</dict>
		<key>model.espresso.shape</key>
		<dict>
			<key>hash</key>
			<data>
			lF2wSOkd21UBmKvG+sdjcnC1Hlo=
			</data>
			<key>hash2</key>
			<data>
			s14/zXAJJ6QuY0e/h+3Vw6juS51aQ7VDk0rO7V9kSos=
			</data>
		</dict>
		<key>model.espresso.weights</key>
		<dict>
			<key>hash</key>
			<data>
			tC8y0Ttrg/sgAB4Pw02eO9QTUhM=
			</data>
			<key>hash2</key>
			<data>
			wkKFFJ7WO6NzO9uh4A0z/UTLEDgWAOEyHfmNEPv1eak=
			</data>
		</dict>
		<key>sentiment.nlmodel</key>
		<dict>
			<key>hash</key>
			<data>
			HB70/+zMkU4gLReiP6GI7q7MjJo=
			</data>
			<key>hash2</key>
			<data>
			3c/GD0D+4cN8WGh42UP20h5k+dfp9XCY9mwrVjerNGE=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
