{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.2",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.3",
      "K" : 1,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "input.2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "logmel",
      "weights" : {
        "W_U8" : 3,
        "lut_to_float32" : 5
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.3",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.4",
      "top" : "input.4",
      "type" : "elementwise",
      "name" : "input.4",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.5",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.6",
      "K" : 32,
      "blob_biases" : 7,
      "name" : "input.5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.4",
      "weights" : {
        "W_U8" : 9,
        "lut_to_float32" : 11
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.6",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.7",
      "top" : "input.7",
      "type" : "elementwise",
      "name" : "input.7",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.9",
      "K" : 32,
      "blob_biases" : 13,
      "name" : "input.8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input.7",
      "weights" : {
        "W_U8" : 15,
        "lut_to_float32" : 17
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.10",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.11",
      "K" : 16,
      "blob_biases" : 19,
      "name" : "input.10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "input.9",
      "weights" : {
        "W_U8" : 21,
        "lut_to_float32" : 23
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.11",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.12",
      "top" : "input.12",
      "type" : "elementwise",
      "name" : "input.12",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.13",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.14",
      "K" : 96,
      "blob_biases" : 25,
      "stride_x" : 2,
      "name" : "input.13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "input.12",
      "weights" : {
        "W_U8" : 27,
        "lut_to_float32" : 29
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.14",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.15",
      "top" : "input.15",
      "type" : "elementwise",
      "name" : "input.15",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.16",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.17",
      "K" : 96,
      "blob_biases" : 31,
      "name" : "input.16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "input.15",
      "weights" : {
        "W_U8" : 33,
        "lut_to_float32" : 35
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.18",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.19",
      "K" : 24,
      "blob_biases" : 37,
      "name" : "input.18",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "input.17",
      "weights" : {
        "W_U8" : 39,
        "lut_to_float32" : 41
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.19",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.20",
      "top" : "input.20",
      "type" : "elementwise",
      "name" : "input.20",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.21",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.22",
      "K" : 144,
      "blob_biases" : 43,
      "name" : "input.21",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "input.20",
      "weights" : {
        "W_U8" : 45,
        "lut_to_float32" : 47
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.22",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.23",
      "top" : "input.23",
      "type" : "elementwise",
      "name" : "input.23",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.24",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "338",
      "K" : 144,
      "blob_biases" : 49,
      "name" : "input.24",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "input.23",
      "weights" : {
        "W_U8" : 51,
        "lut_to_float32" : 53
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.17,338",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.25",
      "nd_mode" : true,
      "top" : "input.25",
      "type" : "elementwise",
      "name" : "input.25",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.26",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.27",
      "K" : 24,
      "blob_biases" : 55,
      "name" : "input.26",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "input.25",
      "weights" : {
        "W_U8" : 57,
        "lut_to_float32" : 59
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.27",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.28",
      "top" : "input.28",
      "type" : "elementwise",
      "name" : "input.28",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.29",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.30",
      "K" : 144,
      "blob_biases" : 61,
      "stride_x" : 2,
      "name" : "input.29",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "input.28",
      "weights" : {
        "W_U8" : 63,
        "lut_to_float32" : 65
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.30",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.31",
      "top" : "input.31",
      "type" : "elementwise",
      "name" : "input.31",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.32",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.33",
      "K" : 144,
      "blob_biases" : 67,
      "name" : "input.32",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.31",
      "weights" : {
        "W_U8" : 69,
        "lut_to_float32" : 71
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.34",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.35",
      "K" : 32,
      "blob_biases" : 73,
      "name" : "input.34",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "input.33",
      "weights" : {
        "W_U8" : 75,
        "lut_to_float32" : 77
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.35",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.36",
      "top" : "input.36",
      "type" : "elementwise",
      "name" : "input.36",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.37",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.38",
      "K" : 192,
      "blob_biases" : 79,
      "name" : "input.37",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "input.36",
      "weights" : {
        "W_U8" : 81,
        "lut_to_float32" : 83
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.38",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.39",
      "top" : "input.39",
      "type" : "elementwise",
      "name" : "input.39",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.40",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "379",
      "K" : 192,
      "blob_biases" : 85,
      "name" : "input.40",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.39",
      "weights" : {
        "W_U8" : 87,
        "lut_to_float32" : 89
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.33,379",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.41",
      "nd_mode" : true,
      "top" : "input.41",
      "type" : "elementwise",
      "name" : "input.41",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.42",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.43",
      "K" : 32,
      "blob_biases" : 91,
      "name" : "input.42",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "input.41",
      "weights" : {
        "W_U8" : 93,
        "lut_to_float32" : 95
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.43",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.44",
      "top" : "input.44",
      "type" : "elementwise",
      "name" : "input.44",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.45",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.46",
      "K" : 192,
      "blob_biases" : 97,
      "name" : "input.45",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "input.44",
      "weights" : {
        "W_U8" : 99,
        "lut_to_float32" : 101
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.46",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.47",
      "top" : "input.47",
      "type" : "elementwise",
      "name" : "input.47",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.48",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "400",
      "K" : 192,
      "blob_biases" : 103,
      "name" : "input.48",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.47",
      "weights" : {
        "W_U8" : 105,
        "lut_to_float32" : 107
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.41,400",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.49",
      "nd_mode" : true,
      "top" : "input.49",
      "type" : "elementwise",
      "name" : "input.49",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.50",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.51",
      "K" : 32,
      "blob_biases" : 109,
      "name" : "input.50",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "input.49",
      "weights" : {
        "W_U8" : 111,
        "lut_to_float32" : 113
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.51",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.52",
      "top" : "input.52",
      "type" : "elementwise",
      "name" : "input.52",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.53",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.54",
      "K" : 192,
      "blob_biases" : 115,
      "stride_x" : 2,
      "name" : "input.53",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "input.52",
      "weights" : {
        "W_U8" : 117,
        "lut_to_float32" : 119
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.54",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.55",
      "top" : "input.55",
      "type" : "elementwise",
      "name" : "input.55",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.56",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.57",
      "K" : 192,
      "blob_biases" : 121,
      "name" : "input.56",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.55",
      "weights" : {
        "W_U8" : 123,
        "lut_to_float32" : 125
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.58",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.59",
      "K" : 64,
      "blob_biases" : 127,
      "name" : "input.58",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.57",
      "weights" : {
        "W_U8" : 129,
        "lut_to_float32" : 131
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.59",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.60",
      "top" : "input.60",
      "type" : "elementwise",
      "name" : "input.60",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.61",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.62",
      "K" : 384,
      "blob_biases" : 133,
      "name" : "input.61",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.60",
      "weights" : {
        "W_U8" : 135,
        "lut_to_float32" : 137
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.62",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.63",
      "top" : "input.63",
      "type" : "elementwise",
      "name" : "input.63",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.64",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "441",
      "K" : 384,
      "blob_biases" : 139,
      "name" : "input.64",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.63",
      "weights" : {
        "W_U8" : 141,
        "lut_to_float32" : 143
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.57,441",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.65",
      "nd_mode" : true,
      "top" : "input.65",
      "type" : "elementwise",
      "name" : "input.65",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.66",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.67",
      "K" : 64,
      "blob_biases" : 145,
      "name" : "input.66",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.65",
      "weights" : {
        "W_U8" : 147,
        "lut_to_float32" : 149
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.67",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.68",
      "top" : "input.68",
      "type" : "elementwise",
      "name" : "input.68",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.69",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.70",
      "K" : 384,
      "blob_biases" : 151,
      "name" : "input.69",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.68",
      "weights" : {
        "W_U8" : 153,
        "lut_to_float32" : 155
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.70",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.71",
      "top" : "input.71",
      "type" : "elementwise",
      "name" : "input.71",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.72",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "462",
      "K" : 384,
      "blob_biases" : 157,
      "name" : "input.72",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.71",
      "weights" : {
        "W_U8" : 159,
        "lut_to_float32" : 161
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.65,462",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.73",
      "nd_mode" : true,
      "top" : "input.73",
      "type" : "elementwise",
      "name" : "input.73",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.74",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.75",
      "K" : 64,
      "blob_biases" : 163,
      "name" : "input.74",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.73",
      "weights" : {
        "W_U8" : 165,
        "lut_to_float32" : 167
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.75",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.76",
      "top" : "input.76",
      "type" : "elementwise",
      "name" : "input.76",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.77",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.78",
      "K" : 384,
      "blob_biases" : 169,
      "name" : "input.77",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.76",
      "weights" : {
        "W_U8" : 171,
        "lut_to_float32" : 173
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.78",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.79",
      "top" : "input.79",
      "type" : "elementwise",
      "name" : "input.79",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.80",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "483",
      "K" : 384,
      "blob_biases" : 175,
      "name" : "input.80",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.79",
      "weights" : {
        "W_U8" : 177,
        "lut_to_float32" : 179
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.73,483",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.81",
      "nd_mode" : true,
      "top" : "input.81",
      "type" : "elementwise",
      "name" : "input.81",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.82",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.83",
      "K" : 64,
      "blob_biases" : 181,
      "name" : "input.82",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.81",
      "weights" : {
        "W_U8" : 183,
        "lut_to_float32" : 185
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.83",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.84",
      "top" : "input.84",
      "type" : "elementwise",
      "name" : "input.84",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.85",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.86",
      "K" : 384,
      "blob_biases" : 187,
      "name" : "input.85",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 384,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "input.84",
      "weights" : {
        "W_U8" : 189,
        "lut_to_float32" : 191
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.86",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.87",
      "top" : "input.87",
      "type" : "elementwise",
      "name" : "input.87",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.88",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.89",
      "K" : 384,
      "blob_biases" : 193,
      "name" : "input.88",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "input.87",
      "weights" : {
        "W_U8" : 195,
        "lut_to_float32" : 197
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.90",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.91",
      "K" : 96,
      "blob_biases" : 199,
      "name" : "input.90",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 576,
      "bottom" : "input.89",
      "weights" : {
        "W_U8" : 201,
        "lut_to_float32" : 203
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.91",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.92",
      "top" : "input.92",
      "type" : "elementwise",
      "name" : "input.92",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.93",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.94",
      "K" : 576,
      "blob_biases" : 205,
      "name" : "input.93",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 576,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 576,
      "bottom" : "input.92",
      "weights" : {
        "W_U8" : 207,
        "lut_to_float32" : 209
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.94",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.95",
      "top" : "input.95",
      "type" : "elementwise",
      "name" : "input.95",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.96",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "524",
      "K" : 576,
      "blob_biases" : 211,
      "name" : "input.96",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "input.95",
      "weights" : {
        "W_U8" : 213,
        "lut_to_float32" : 215
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.89,524",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.97",
      "nd_mode" : true,
      "top" : "input.97",
      "type" : "elementwise",
      "name" : "input.97",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.98",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.99",
      "K" : 96,
      "blob_biases" : 217,
      "name" : "input.98",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 576,
      "bottom" : "input.97",
      "weights" : {
        "W_U8" : 219,
        "lut_to_float32" : 221
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.99",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.100",
      "top" : "input.100",
      "type" : "elementwise",
      "name" : "input.100",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.101",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.102",
      "K" : 576,
      "blob_biases" : 223,
      "name" : "input.101",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 576,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 576,
      "bottom" : "input.100",
      "weights" : {
        "W_U8" : 225,
        "lut_to_float32" : 227
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.102",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.103",
      "top" : "input.103",
      "type" : "elementwise",
      "name" : "input.103",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.104",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "545",
      "K" : 576,
      "blob_biases" : 229,
      "name" : "input.104",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "input.103",
      "weights" : {
        "W_U8" : 231,
        "lut_to_float32" : 233
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.97,545",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.105",
      "nd_mode" : true,
      "top" : "input.105",
      "type" : "elementwise",
      "name" : "input.105",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.106",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.107",
      "K" : 96,
      "blob_biases" : 235,
      "name" : "input.106",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 576,
      "bottom" : "input.105",
      "weights" : {
        "W_U8" : 237,
        "lut_to_float32" : 239
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.107",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.108",
      "top" : "input.108",
      "type" : "elementwise",
      "name" : "input.108",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.109",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.110",
      "K" : 576,
      "blob_biases" : 241,
      "stride_x" : 2,
      "name" : "input.109",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 576,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 576,
      "bottom" : "input.108",
      "weights" : {
        "W_U8" : 243,
        "lut_to_float32" : 245
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.110",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.111",
      "top" : "input.111",
      "type" : "elementwise",
      "name" : "input.111",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.112",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.113",
      "K" : 576,
      "blob_biases" : 247,
      "name" : "input.112",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 160,
      "bottom" : "input.111",
      "weights" : {
        "W_U8" : 249,
        "lut_to_float32" : 251
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.114",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.115",
      "K" : 160,
      "blob_biases" : 253,
      "name" : "input.114",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 960,
      "bottom" : "input.113",
      "weights" : {
        "W_U8" : 255,
        "lut_to_float32" : 257
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.115",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.116",
      "top" : "input.116",
      "type" : "elementwise",
      "name" : "input.116",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.117",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.118",
      "K" : 960,
      "blob_biases" : 259,
      "name" : "input.117",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 960,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 960,
      "bottom" : "input.116",
      "weights" : {
        "W_U8" : 261,
        "lut_to_float32" : 263
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.118",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.119",
      "top" : "input.119",
      "type" : "elementwise",
      "name" : "input.119",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.120",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "586",
      "K" : 960,
      "blob_biases" : 265,
      "name" : "input.120",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 160,
      "bottom" : "input.119",
      "weights" : {
        "W_U8" : 267,
        "lut_to_float32" : 269
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.113,586",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.121",
      "nd_mode" : true,
      "top" : "input.121",
      "type" : "elementwise",
      "name" : "input.121",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.122",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.123",
      "K" : 160,
      "blob_biases" : 271,
      "name" : "input.122",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 960,
      "bottom" : "input.121",
      "weights" : {
        "W_U8" : 273,
        "lut_to_float32" : 275
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.123",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.124",
      "top" : "input.124",
      "type" : "elementwise",
      "name" : "input.124",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.125",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.126",
      "K" : 960,
      "blob_biases" : 277,
      "name" : "input.125",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 960,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 960,
      "bottom" : "input.124",
      "weights" : {
        "W_U8" : 279,
        "lut_to_float32" : 281
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.126",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.127",
      "top" : "input.127",
      "type" : "elementwise",
      "name" : "input.127",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.128",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "607",
      "K" : 960,
      "blob_biases" : 283,
      "name" : "input.128",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 160,
      "bottom" : "input.127",
      "weights" : {
        "W_U8" : 285,
        "lut_to_float32" : 287
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.121,607",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.129",
      "nd_mode" : true,
      "top" : "input.129",
      "type" : "elementwise",
      "name" : "input.129",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.130",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.131",
      "K" : 160,
      "blob_biases" : 289,
      "name" : "input.130",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 960,
      "bottom" : "input.129",
      "weights" : {
        "W_U8" : 291,
        "lut_to_float32" : 293
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.131",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.132",
      "top" : "input.132",
      "type" : "elementwise",
      "name" : "input.132",
      "beta" : 6
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.133",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.134",
      "K" : 960,
      "blob_biases" : 295,
      "name" : "input.133",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 960,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 960,
      "bottom" : "input.132",
      "weights" : {
        "W_U8" : 297,
        "lut_to_float32" : 299
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "input.134",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.135",
      "top" : "input.135",
      "type" : "elementwise",
      "name" : "input.135",
      "beta" : 6
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.136",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.137",
      "K" : 960,
      "blob_biases" : 301,
      "name" : "input.136",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 320,
      "bottom" : "input.135",
      "weights" : {
        "W_U8" : 303,
        "lut_to_float32" : 305
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.138",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input",
      "K" : 320,
      "blob_biases" : 307,
      "name" : "input.138",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "input.137",
      "weights" : {
        "W_U8" : 309,
        "lut_to_float32" : 311
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "input",
      "alpha" : 0,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "feature_map",
      "top" : "feature_map",
      "type" : "elementwise",
      "name" : "feature_map",
      "beta" : 6
    },
    {
      "axis_mode" : 2,
      "bottom" : "feature_map",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "637",
      "use_version" : 1,
      "top" : "feature_map__reduction_axis__1",
      "type" : "reduce",
      "name" : "637__reduction_axis__0"
    },
    {
      "axis_mode" : 1,
      "bottom" : "feature_map__reduction_axis__1",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 3,
      "nd_mode" : true,
      "debug_info" : "637",
      "use_version" : 1,
      "top" : "637_presqueeze",
      "type" : "reduce",
      "name" : "637_presqueeze"
    },
    {
      "name" : "637",
      "version" : 1,
      "axes_1" : 3,
      "type" : "squeeze",
      "axes_0" : 2,
      "attributes" : {
        "is_output" : 1
      },
      "nd_axis" : 0,
      "bottom" : "637_presqueeze",
      "debug_info" : "637",
      "size_of_axes" : 2,
      "weights" : {

      },
      "top" : "637"
    }
  ]
}